In [55]:
import pandas as pd
import numpy as np
string_data=pd.Series(['apple','bonny',np.nan,'justify'])
string_data
string_data.isnull()
string_data[1]=None
string_data
string_data.isnull()

0    False
1     True
2     True
3    False
dtype: bool

In [56]:
from numpy import nan as NA
data=pd.Series([4396,NA,433,NA])
data.dropna() #data[data.notnull()]

0    4396.0
2     433.0
dtype: float64

In [17]:
data=pd.DataFrame([[1,2,NA],[1,NA,NA],[NA,NA,NA]])
data

     0    1   2
0  1.0  2.0 NaN
1  1.0  NaN NaN
2  NaN  NaN NaN

In [18]:
cleaned_all=data.dropna()
cleaned_all
cleaned_part=data.dropna(how='all')
cleaned_part
cleaned_partCol=data.dropna(how='all',axis=1)
cleaned_partCol

     0    1
0  1.0  2.0
1  1.0  NaN
2  NaN  NaN

In [19]:
df=pd.DataFrame(np.random.randn(7,3))
df.iloc[:4,1]=NA
df.iloc[:2,2]=NA
df

          0         1         2
0  0.712867       NaN       NaN
1 -1.376677       NaN       NaN
2  1.301761       NaN  0.831832
3 -0.743076       NaN  0.411086
4  1.334129 -0.069524  1.503068
5  0.290738 -1.623232 -0.552469
6 -0.438588 -0.334180 -0.058380

In [30]:
df.dropna(thresh=2)#每行中至少有两个及以上的非NA value才不会被删除

          0         1         2
2  1.301761       NaN  0.831832
3 -0.743076       NaN  0.411086
4  1.334129 -0.069524  1.503068
5  0.290738 -1.623232 -0.552469
6 -0.438588 -0.334180 -0.058380

In [32]:
df.fillna({1:0.5,2:0.4}) #添加参数 inplace=True 实现就地修改

          0         1         2
0  0.712867  0.500000  0.400000
1 -1.376677  0.500000  0.400000
2  1.301761  0.500000  0.831832
3 -0.743076  0.500000  0.411086
4  1.334129 -0.069524  1.503068
5  0.290738 -1.623232 -0.552469
6 -0.438588 -0.334180 -0.058380

In [40]:
df=pd.DataFrame(np.arange(15).reshape(5,3))
df.iloc[:2,1]=NA
df.iloc[:4,2]=NA
df

    0     1     2
0   0   NaN   NaN
1   3   NaN   NaN
2   6   7.0   NaN
3   9  10.0   NaN
4  12  13.0  14.0

In [48]:
df.fillna(method='ffill',limit=1,axis=1)

      0     1     2
0   0.0   0.0   NaN
1   3.0   3.0   NaN
2   6.0   7.0   7.0
3   9.0  10.0  10.0
4  12.0  13.0  14.0

In [53]:
data=pd.DataFrame({'k1':['one','two']*3+['two'],
                   'k2':[1,2,3,4,5,6,6]})
data

    k1  k2
0  one   1
1  two   2
2  one   3
3  two   4
4  one   5
5  two   6
6  two   6

In [55]:
data.duplicated()
data.drop_duplicates()

    k1  k2
0  one   1
1  two   2
2  one   3
3  two   4
4  one   5
5  two   6

In [61]:
data['v1']=range(7)
data.drop_duplicates(['k1']) 
#duplicated和drop_duplicates默认保留的是第一个出现的值组合。传入keep='last'则保留最后一个

    k1  k2  v1
0  one   1   0
1  two   2   1

In [64]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [67]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}
data_lowcase=data['food'].str.lower()
data['animal']=data_lowcase.map(meat_to_animal)
#匿名函数写法
#data['animal']=data['food'].map(lambda x:meat_to_animal[x.lower()])
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [6]:
data=pd.Series([1,-999,2,-999,3,-1000])
data

0       1
1    -999
2       2
3    -999
4       3
5   -1000
dtype: int64

In [8]:
data.replace([-999,-1000],NA)
data.replace({-999:NA,-1000:NA})

0    1.0
1    NaN
2    2.0
3    NaN
4    3.0
5    NaN
dtype: float64

In [9]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
transform=lambda x:x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [10]:
data.rename(index=str.title,columns=str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [13]:
data.rename(index={'Ohio':'INDIANA'},columns={'three':'pika'})

          one  two  pika  four
INDIANA     0    1     2     3
Colorado    4    5     6     7
New York    8    9    10    11

In [22]:
ages=[20,22,25,27,21, 23, 37, 31, 61, 45, 41, 32]
bins=[18,25,35,60,100]
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
cats=pd.cut(ages,bins,labels=group_names)
cats.codes
cats.categories
cats.value_counts(cats)

Youth         5
YoungAdult    3
MiddleAged    3
Senior        1
dtype: int64

In [21]:
cats2=pd.cut(ages, [18, 26, 36, 61, 100], right=False)
cats2.categories

IntervalIndex([[18, 26), [26, 36), [36, 61), [61, 100)]
              closed='left',
              dtype='interval[int64]')

In [26]:
data=np.random.randn(20)
cats3=pd.cut(data,4,precision=2)
cats3.value_counts()

(-1.1, -0.39]    6
(-0.39, 0.32]    8
(0.32, 1.03]     4
(1.03, 1.74]     2
dtype: int64

In [29]:
cats4=pd.qcut(data,4,precision=3)
cats4.value_counts()

(-1.0999999999999999, -0.532]    5
(-0.532, -0.129]                 5
(-0.129, 0.342]                  5
(0.342, 1.736]                   5
dtype: int64

In [31]:
data=pd.DataFrame(np.random.randn(1000,4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.004867     0.059592    -0.011408     0.029464
std       1.000318     1.017161     1.000326     1.003025
min      -3.090599    -3.690256    -2.792004    -2.693804
25%      -0.664001    -0.646377    -0.726034    -0.667778
50%      -0.035054     0.093811    -0.029706    -0.009297
75%       0.662800     0.765829     0.673725     0.700612
max       3.364045     3.118032     3.063306     3.380645

In [41]:
col=data[2]
col[np.abs(col)>3]
data[(np.abs(data)>3).any(1)]

            0         1         2         3
73   0.352133 -1.334813  3.054189  1.554256
194 -1.612431 -0.171157  3.063306  1.123022
226  0.320059  0.980831 -0.834737  3.010612
271 -0.410902 -0.646346  3.015953 -0.759781
407 -3.090599  0.716226  0.654365  0.423499
522  0.430639  0.156508 -0.834444  3.083701
541  1.063132  3.118032  0.476952  1.262355
680  0.417059  1.808670 -0.264138  3.380645
700 -0.872651  0.829868  3.060504  0.955954
749  3.364045 -0.116423 -0.547963  0.376858
795  0.971647 -3.690256 -0.674472  0.458398

In [46]:
data[np.abs(data)>3]=np.sign(data)*3
data.describe()
#np.sign(data).head()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.004593     0.060165    -0.011602     0.028989
std       0.998883     1.014496     0.999736     1.001540
min      -3.000000    -3.000000    -2.792004    -2.693804
25%      -0.664001    -0.646377    -0.726034    -0.667778
50%      -0.035054     0.093811    -0.029706    -0.009297
75%       0.662800     0.765829     0.673725     0.700612
max       3.000000     3.000000     3.000000     3.000000

In [51]:
df=pd.DataFrame(np.arange(20).reshape(5,4))
sampler=np.random.permutation(5)
sampler

array([2, 0, 3, 4, 1])

In [52]:
df.take(sampler)

    0   1   2   3
2   8   9  10  11
0   0   1   2   3
3  12  13  14  15
4  16  17  18  19
1   4   5   6   7

In [59]:
df.sample(n=3)

    0   1   2   3
4  16  17  18  19
0   0   1   2   3
3  12  13  14  15

In [63]:
choices=pd.Series([5,7])
draws=choices.sample(n=8,replace=True)
draws

1    7
1    7
1    7
0    5
0    5
1    7
0    5
0    5
dtype: int64

In [67]:
df=pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                 'data1': range(6)})
dummies=pd.get_dummies(df['key'],prefix='key')
df_with_dummy=df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [71]:
mnames=['movie_id','title','genres']
movies=pd.read_table('datasets/movielens/movies.dat', sep='::',
                      header=None, names=mnames,engine='python')
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [76]:
all_genres=[]
for x in movies.genres:
    all_genres.extend(x.split('|'))
#genres=set(all_genres)
genres=pd.unique(all_genres)
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [87]:
zero_matrix=np.zeros((len(movies),len(genres)))
dummies=pd.DataFrame(zero_matrix,columns=genres)
for i,gen in enumerate(movies.genres):
    indices=dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i,indices]=1
movies_windic=movies.join(dummies.add_prefix('Genre_'))
movies_windic.iloc[2]

movie_id                                   3
title                Grumpier Old Men (1995)
genres                        Comedy|Romance
Genre_Animation                            0
Genre_Children's                           0
Genre_Comedy                               1
Genre_Adventure                            0
Genre_Fantasy                              0
Genre_Romance                              1
Genre_Drama                                0
Genre_Action                               0
Genre_Crime                                0
Genre_Thriller                             0
Genre_Horror                               0
Genre_Sci-Fi                               0
Genre_Documentary                          0
Genre_War                                  0
Genre_Musical                              0
Genre_Mystery                              0
Genre_Film-Noir                            0
Genre_Western                              0
Name: 2, dtype: object

In [90]:
val='a,b,  guido'
val.split(',')
pieces=[x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [93]:
#a,b,c=pieces
#a+'::'+b+"::"+c
'::'.join(pieces)

'a::b::guido'

In [97]:
'guido' in val
val.index(',')
val.find(';')

-1

In [98]:
val.count(',')

2

In [99]:
val.replace(',','::')

'a::b::  guido'